9front-multiplexing.org
#+TITLE: multiplexing on 9front
#+SETUPFILE: setupfile.org

this page details how to (re)attach to processes. if you just have an
unstable connection, and do not want to reattach from a seperate
machine, consider aan(8) instead.

#+TOC: headlines 3

* text

** pin (mq)

[[https://git.sr.ht/~kvik/mq][mq]]'s included [[http://a-b.xyz/9b/2151][pin(1)]] wrapper lets you easily re-attach to commands

** hubfs

hubfs is similar to mq, but older, and does not include an equivalant
to pin(1)

* graphical

** TODO mounting a rio session
find the rio session you want to connect to in ~/srv~ and then you can
mount it to your ~/mnt/wsys~

#+begin_example
mount '#s/rio.glenda.700' /mnt/wsys 1
#+end_example

and then bind the stuff you need to the equivalants in ~/dev~
