9front-multiplexing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-30 Fri 12:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>multiplexing on 9front</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">multiplexing on 9front</h1>
<p>
this page details how to (re)attach to processes. if you just have an
unstable connection, and do not want to reattach from a seperate
machine, consider aan(8) instead.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. text</a>
<ul>
<li><a href="#org0000001">1.1. pin (mq)</a></li>
<li><a href="#org0000002">1.2. hubfs</a></li>
</ul>
</li>
<li><a href="#org0000003">2. graphical</a>
<ul>
<li><a href="#org0000004">2.1. <span class="todo TODO">TODO</span> mounting a rio session</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> text</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.1.</span> pin (mq)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://git.sr.ht/~kvik/mq">mq</a>'s included <a href="http://a-b.xyz/9b/2151">pin(1)</a> wrapper lets you easily re-attach to commands
</p>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.2.</span> hubfs</h3>
<div class="outline-text-3" id="text-1-2">
<p>
hubfs is similar to mq, but older, and does not include an equivalant
to pin(1)
</p>
</div>
</div>
</div>

<div id="outline-container-org0000003" class="outline-2">
<h2 id="org0000003"><span class="section-number-2">2.</span> graphical</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0000004" class="outline-3">
<h3 id="org0000004"><span class="section-number-3">2.1.</span> <span class="todo TODO">TODO</span> mounting a rio session</h3>
<div class="outline-text-3" id="text-2-1">
<p>
find the rio session you want to connect to in <code>/srv</code> and then you can
mount it to your <code>/mnt/wsys</code>
</p>

<pre class="example" id="org0000005">
mount '#s/rio.glenda.700' /mnt/wsys 1
</pre>

<p>
and then bind the stuff you need to the equivalants in <code>/dev</code>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
